{
  "image": "https://s3.amazonaws.com/leadkit-agent-files-staging/img/agents/000/080/512/about_me_image/koala-1493754703.jpg",
  "logo": "https://s3.amazonaws.com/leadkit-agent-files-staging/img/agents/000/080/512/about_me_logo/index2-1477057717.jpeg",
  "bio": "<!--block-->\n<p>Danny Davis is a rare breed of broker who is revered and sought by clients and colleagues for his market expertise and innovative marketing&nbsp;of downtown's most distinctive properties. Serving a diverse clientele from financial moguls to big-name entertainers and many others, Danny has achieved highly coveted success in his 15+ years in the Manhattan real estate business as a top producer since year one.Danny specializes in sales and rentals of archetypal properties in premium downtown neighborhoods. He is respected throughout the industry as a skillful marketer and expert negotiator who facilitates successful deals, and exceeds his discerning clientele's expectations. He's also known as the broker on wheels who you'll often see riding his bike around town trying to beat the traffic to his next appointment!Danny's&nbsp;utmost goal is to make clients feel well cared for and well educated throughout the real estate process. His ease in working with people of all kinds stems from his world travel background that has included visiting places like Brazil, India and Africa, and adventures like living in a cave, hiking the highest mountains, even bungee jumping off bridges. Danny and his wife, whom he met backpacking in Bolivia, live with their five children in Tribeca in a loft they gut-renovated. Danny&nbsp;hails from Cherry Hill, NJ, though is a lifelong \"Phila fan.\" His passion for world issues stems back to his studies in Middle Eastern Politics and Comparative Religion which he completed at Columbia University and The Jewish Theological Seminary in New York.</p>",
  "title": "Meet Danny.",
  "embed_video": "<iframe src=\"https://player.vimeo.com/video/127192426\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>"
}